Repository: Distrotech/diffutils
Catalog: po/.reference/*.po
Languages: ga

source: program error
ga: earráid chláir

source: stack overflow
ga: cruach thar maoil

source: Unknown system error
ga: Earráid chórais anaithnid

source: regular empty file
ga: gnáthchomhad folamh

source: regular file
ga: gnáthchomhad

source: directory
ga: comhadlann

source: block special file
ga: comhad speisialta den chineál `bloc'

source: character special file
ga: comhad speisialta den chineál `carachtar'

source: symbolic link
ga: nasc siombalach

source: socket
ga: soicéad

source: message queue
ga: ciú teachtaireachta

source: semaphore
ga: séamafór

source: shared memory object
ga: comhad comhchuimhne

source: typed memory object
ga: comhad cuimhne le cineál

source: weird file
ga: comhad aisteach

source: %s: option `%s' is ambiguous
ga: %s: Tá an rogha `%s' débhríoch

source: %s: option `--%s' doesn't allow an argument
ga: %s: ní cheadaítear argóint i ndiaidh na rogha `--%s'

source: %s: option `%c%s' doesn't allow an argument
ga: %s: ní cheadaítear argóint i ndiaidh na rogha `%c%s'

source: %s: option `%s' requires an argument
ga: %s: ní foláir argóint don rogha `%s'

source: %s: unrecognized option `--%s'
ga: %s: rogha anaithnid `--%s'

source: %s: unrecognized option `%c%s'
ga: %s: rogha anaithnid `%c%s'

source: %s: illegal option -- %c
ga: %s: rogha neamhcheadaithe -- %c

source: %s: invalid option -- %c
ga: %s: rogha neamhbhailí -- %c

source: %s: option requires an argument -- %c
ga: %s: ní foláir argóint don rogha -- %c

source: %s: option `-W %s' is ambiguous
ga: %s: Tá an rogha `-W %s' débhríoch

source: %s: option `-W %s' doesn't allow an argument
ga: %s: ní cheadaítear argóint i ndiaidh na rogha `-W %s'

source: Success
ga: Bua!

source: No match
ga: Níl a leithéid ann

source: Invalid regular expression
ga: Slonn ionadaíochta neamhbhailí

source: Invalid collation character
ga: Carachtar cóimheasa neamhbhailí

source: Invalid character class name
ga: Aicme charachtair neamhbhailí

source: Trailing backslash
ga: Cúlslais ag deireadh

source: Invalid back reference
ga: Cúltagairt neamhbhailí

source: Unmatched [ or [^
ga: [ nó [^ corr

source: Unmatched ( or \(
ga: ( nó \( corr

source: Unmatched \{
ga: \{ corr

source: Invalid content of \{\}
ga: Ábhar neamhbhailí idir \{\}

source: Invalid range end
ga: Deireadh raoin neamhbhailí

source: Memory exhausted
ga: Cuimhne ídithe

source: Invalid preceding regular expression
ga: Is neamhbhailí an slonn ionadaíochta roimhe seo

source: Premature end of regular expression
ga: Deireadh le slonn ionadaíochta gan choinne

source: Regular expression too big
ga: Slonn ionadaíochta rómhór

source: Unmatched ) or \)
ga: ) nó \) corr

source: No previous regular expression
ga: Níl aon slonn ionadaíochta roimhe seo

source: memory exhausted
ga: cuimhne ídithe

source: Written by %s.
ga: Le %s.

source: Written by %s and %s.
ga: Le %s agus %s.

source: Written by %s, %s, and %s.
ga: Le %s, %s, agus %s.

source: Written by %s, %s, %s, and %s.
ga: Le %s, %s, %s, agus %s.

source: Written by %s, %s, %s, %s, and %s.
ga: Le %s, %s, %s, %s, agus %s.

source: Written by %s, %s, %s, %s, %s, and %s.
ga: Le %s, %s, %s, %s, %s, agus %s.

source: Written by %s, %s, %s, %s, %s, %s, and %s.
ga: Le %s, %s, %s, %s, %s, %s, agus %s.

source: Written by %s, %s, %s, %s, %s, %s, %s, and %s.
ga: Le %s, %s, %s, %s, %s, %s, %s, agus %s.

source: Written by %s, %s, %s, %s, %s, %s, %s, %s, and %s.
ga: Le %s, %s, %s, %s, %s, %s, %s, %s, agus %s.

source: Written by %s, %s, %s, %s, %s, %s, %s, %s, %s, and others.
ga: Le %s, %s, %s, %s, %s, %s, %s, %s, %s, agus daoine eile nach iad.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
ga: Is saorbhogearra an ríomhchlár seo; féach ar an bhunchód le haghaidh coinníollacha cóipeála. Níl baránta ar bith ann; go fiú níl baránta ann d'INDÍOLTACHT nó FEILIÚNACHT DO FHEIDHM AR LEITH.

source: Files %s and %s differ
ga: Tá difríocht idir na comhaid %s agus %s

source: No newline at end of file
ga: Gan líne nua ag an chomhadchríoch

source: Try `%s --help' for more information.
ga: Bain triail as `%s --help' chun tuilleadh eolais a fháil.

source: invalid --ignore-initial value `%s'
ga: luach neamhbhailí --ignore-initial `%s'

source: options -l and -s are incompatible
ga: Níl na roghanna -l agus -s comhoiriúnach

source: write failed
ga: teipeadh ag scríobh

source: standard output
ga: aschur caighdeánach

source: -b --print-bytes Print differing bytes.
ga: -b --print-bytes Taispeáin na bearta atá difriúla.

source: -i SKIP --ignore-initial=SKIP Skip the first SKIP bytes of input.
ga: -i UIMHIR --ignore-initial=UIMHIR Gabh thar an chéad UIMHIR beart ionchurtha.

source: -i SKIP1:SKIP2 --ignore-initial=SKIP1:SKIP2
ga: -i SCIP1:SCIP2 --ignore-initial=SCIP1:SCIP2

source: Skip the first SKIP1 bytes of FILE1 and the first SKIP2 bytes of FILE2.
ga: Gabh thar an chéad SCIP1 beart as COMHAD1 agus SCIP2 as COMHAD2.

source: -l --verbose Output byte numbers and values of all differing bytes.
ga: -l --verbose Taispeáin uimhreacha agus luachanna do bhearta uile difriúla.

source: -n LIMIT --bytes=LIMIT Compare at most LIMIT bytes.
ga: -n TEOR --bytes=TEOR Cuir TEOR beart i gcomparáid, ar a mhéad.

source: -s --quiet --silent Output nothing; yield exit status only.
ga: -s --quiet --silent Ná haschuir rud ar bith; gin stádas scortha.

source: -v --version Output version info.
ga: -v --version Taispeáin eolas faoin leagan.

source: --help Output this help.
ga: --help Taispeáin an chabhair seo..

source: Usage: %s [OPTION]... FILE1 [FILE2 [SKIP1 [SKIP2]]]
ga: Úsáid: %s [ROGHA]... COMHAD1 [COMHAD2 [SCIPEÁIL1 [SCIPEÁIL2]]]

source: Compare two files byte by byte.
ga: Cuir dhá chomhad i gcomparáid, beart le beart.

source: SKIP1 and SKIP2 are the number of bytes to skip in each file.
ga: Is éard atá i SCIP1 agus SCIP2 ná líonta na mbeart a scipeáil i ngach comhad.

source: SKIP values may be followed by the following multiplicative suffixes: kB 1000, K 1024, MB 1,000,000, M 1,048,576, GB 1,000,000,000, G 1,073,741,824, and so on for T, P, E, Z, Y.
ga: Is féidir na hiarmhíreanna a leanas a chur i ndiaidh SCIP: kB 1000, K 1024, MB 1,000,000, M 1,048,576, GB 1,000,000,000, G 1,073,741,824, srl. do T, P, E, Z, Y.

source: If a FILE is `-' or missing, read standard input.
ga: Mura bhfuil COMHAD ann, nó más `-' é, léigh ón ionchur caighdeánach.

source: Exit status is 0 if inputs are the same, 1 if different, 2 if trouble.
ga: Stádas scortha: 0 más ionann iad, 1 más difriúil, 2 má tá fadhb ann.

source: Report bugs to <bug-gnu-utils@gnu.org>.
ga: Seol tuairiscí fabhtanna chuig <bug-gnu-utils@gnu.org>.

source: invalid --bytes value `%s'
ga: luach neamhbhailí --bytes `%s'

source: missing operand after `%s'
ga: ní foláir argóint i ndiaidh `%s'

source: extra operand `%s'
ga: oibreann breise `%s'

source: %s %s differ: byte %s, line %s
ga: %s %s difriúil: beart %s, líne %s

source: %s %s differ: byte %s, line %s is %3o %s %3o %s
ga: %s %s difriúil: beart %s, líne %s = %3o %s %3o %s

source: cmp: EOF on %s
ga: cmp: EOF ar %s

source: invalid context length `%s'
ga: Fad neamhbhailí comhthéacs `%s'

source: pagination not supported on this host
ga: Ní thacaítear leis an uimhriú leathanach ar an óstríomhaire seo

source: too many file label options
ga: an iomarca argóintí do lipéid chomhaid

source: invalid width `%s'
ga: leithead neamhbhailí `%s'

source: conflicting width options
ga: roghanna leithid contrártha

source: invalid horizon length `%s'
ga: fad léaslíne neamhbhailí `%s'

source: invalid tabsize `%s'
ga: tá an mhéid tháib `%s' neamhbhailí

source: conflicting tabsize options
ga: Roghanna tábmhéid contrártha

source: `-%ld' option is obsolete; use `-%c %ld'
ga: tá an rogha `-%ld' as feidhm; bain úsáid as `-%c %ld'

source: `-%ld' option is obsolete; omit it
ga: tá an rogha `-%ld' as feidhm; fág é ar lár

source: --from-file and --to-file both specified
ga: tugadh --from-file agus --to-file lena chéile

source: Compare files line by line.
ga: Déan comparáid idir na comhaid, líne ar líne.

source: -i --ignore-case Ignore case differences in file contents.
ga: -i --ignore-case Ná bí cásíogair le hinneachar na gcomhad.

source: --ignore-file-name-case Ignore case when comparing file names.
ga: --ignore-file-name-case Ná bí cásíogair le hainmneacha comhaid.

source: --no-ignore-file-name-case Consider case when comparing file names.
ga: --no-ignore-file-name-case Bí cásíogair maidir le hainmneacha comhaid.

source: -E --ignore-tab-expansion Ignore changes due to tab expansion.
ga: -E --ignore-tab-expansion Déan neamhshuim ar athruithe ó leathnú na dtáib.

source: -b --ignore-space-change Ignore changes in the amount of white space.
ga: -b --ignore-space-change Déan neamhshuim ar mhéid an spáis bán.

source: -w --ignore-all-space Ignore all white space.
ga: -w --ignore-all-space Déan neamhshuim ar spás bán go hiomlán.

source: -B --ignore-blank-lines Ignore changes whose lines are all blank.
ga: -B --ignore-blank-lines Déan neamhshuim ar línte folmha.

source: -I RE --ignore-matching-lines=RE Ignore changes whose lines all match RE.
ga: -I SI --ignore-matching-lines=RE Déan neamhshuim ar línte atá comhoiriúnach leis an slonn SI.

source: --strip-trailing-cr Strip trailing carriage return on input.
ga: --strip-trailing-cr Dealaigh aisfhilleadh carráiste ó gach líne ionchurtha.

source: --binary Read and write data in binary mode.
ga: --binary Léigh agus scríobh sonraí sa mhód dénártha.

source: -a --text Treat all files as text.
ga: -a --text Caith le gach comhad mar théacschomhad.

source: -c -C NUM --context[=NUM] Output NUM (default 3) lines of copied context. -u -U NUM --unified[=NUM] Output NUM (default 3) lines of unified context. --label LABEL Use LABEL instead of file name. -p --show-c-function Show which C function each change is in. -F RE --show-function-line=RE Show the most recent line matching RE.
ga: -c -C UIMHIR --context[=UIMHIR] Taispeáin UIMHIR líne de chomhthéacs cóipeáilte (réamhshocrú = 3). -u -U UIMHIR --unified[=UIMHIR] Taispeáin UIMHIR líne de chomhthéacs aontaithe (réamhshocrú = 3). --label LIPÉAD Bain úsáid as LIPÉAD in ionad ainm comhaid. -p --show-c-function Taispeáin an fheidhm C do gach difríocht. -F SI --show-function-line=SI Taispeáin an líne is déanaí atá comhoiriúnach leis an slonn SI.

source: -q --brief Output only whether files differ.
ga: -q --brief Ná taispeáin ach difriúil nó nach ea.

source: -e --ed Output an ed script.
ga: -e --ed Aschuir script `ed'.

source: --normal Output a normal diff.
ga: --normal Aschuir diff coitianta.

source: -n --rcs Output an RCS format diff.
ga: -n --rcs Aschuir diff i gcruth RCS.

source: -y --side-by-side Output in two columns. -W NUM --width=NUM Output at most NUM (default 130) print columns. --left-column Output only the left column of common lines. --suppress-common-lines Do not output common lines.
ga: -y --side-by-side Taispeáin le dhá cholún. -W UIMH --width=UIMH Taispeáin UIMH carachtar sa líne ar a mhéad, (réamhshocrú=130). --left-column Ná taispeáin ach an colún ar clé do línte céanna --suppress-common-lines Ná taispeáin línte céanna.

source: -D NAME --ifdef=NAME Output merged file to show `#ifdef NAME' diffs.
ga: -D AINM --ifdef=AINM Taispeáin comhad cumaiscthe chun na diff-aí `#ifdef AINM' a léiriú

source: --GTYPE-group-format=GFMT Similar, but format GTYPE input groups with GFMT.
ga: --GCINL-group-format=GFMD Taispeáin grúpaí GCINL ionchuir de réir GFMD.

source: --line-format=LFMT Similar, but format all input lines with LFMT.
ga: --line-format=LFMD Taispeáin gach líne ionchuir de réir LFMD.

source: --LTYPE-line-format=LFMT Similar, but format LTYPE input lines with LFMT.
ga: --LCINL-line-format=LFMD Taispeáin línte LCINL ionchuir de réir LFMD.

source: LTYPE is `old', `new', or `unchanged'. GTYPE is LTYPE or `changed'.
ga: LCINL = `old', `new', nó `unchanged'. GCINL = LCINL nó `changed'.

source: GFMT may contain: %< lines from FILE1 %> lines from FILE2 %= lines common to FILE1 and FILE2 %[-][WIDTH][.[PREC]]{doxX}LETTER printf-style spec for LETTER LETTERs are as follows for new group, lower case for old group: F first line number L last line number N number of lines = L-F+1 E F-1 M L+1
ga: Is éard atá i GFMT ná: %< línte as COMHAD1 %> línte as COMHAD2 %= línte atá i gCOMHAD1 agus COMHAD2 araon %[-][LEITHEAD][.[SONRÚ]]{doxX}LITIR sonrú do litir mar C `printf' Is LITIR mar a leanas (agus litreacha beaga don ghrúpa `old'): F an chéad líne-uimhir L an líne-uimhir dheiridh N líon na línte = L-F+1 E F-1 M L+1

source: LFMT may contain: %L contents of line %l contents of line, excluding any trailing newline %[-][WIDTH][.[PREC]]{doxX}n printf-style spec for input line number
ga: Is éard atá i LFMT ná:: %L ábhar na líne %l ábhar na líne, gan aon líne nua %[-][LEITHEAD][.[SONRÚ]]{doxX}n sonrú do líne-uimhir mar C `printf'

source: Either GFMT or LFMT may contain: %% % %c'C' the single character C %c'\OOO' the character with octal code OOO
ga: Is féidir na teaghráin a leanas a bheith i GLA nó LLA: %% % %c'C' an carachtar litriúil C %c'\OOO' an carachtar le cód ochtnártha OOO

source: -l --paginate Pass the output through `pr' to paginate it.
ga: -l --paginate uimhrigh leathanaigh le `pr'.

source: -t --expand-tabs Expand tabs to spaces in output.
ga: -t --expand-tabs leathnaigh táib go spásanna san aschur.

source: -T --initial-tab Make tabs line up by prepending a tab.
ga: -T --initial-tab Ailínigh táib trí tháb a chur in ionad spás tosaigh.

source: --tabsize=NUM Tab stops are every NUM (default 8) print columns.
ga: --tabsize=UIMH Tábstop gach UIMH colún (réamhshocrú=8).

source: -r --recursive Recursively compare any subdirectories found.
ga: -r --recursive Cuir fochomhadlanna i gcomparáid go hathchúrsach.

source: -N --new-file Treat absent files as empty.
ga: -N --new-file Caith le comhad ar iarraidh mar chomhad folamh.

source: --unidirectional-new-file Treat absent first files as empty.
ga: --unidirectional-new-file Más ar iarraidh, caith leis an chéad chomhad mar chomhad folamh.

source: -s --report-identical-files Report when two files are the same.
ga: -s --report-identical-files Tuairiscigh nuair atá dhá chomhad comhionanna.

source: -x PAT --exclude=PAT Exclude files that match PAT.
ga: -X SLONN --exclude=SLONN Fág comhaid as má tá siad comhoiriúnacha le SLONN.

source: -X FILE --exclude-from=FILE Exclude files that match any pattern in FILE.
ga: -X COMHAD --exclude-from=COMHAD Fág comhaid as má tá siad comhoiriúnacha le haon slonn ionadaíochta as an CHOMHAD.

source: -S FILE --starting-file=FILE Start with FILE when comparing directories.
ga: -S COMHAD --starting-file=COMHAD Tosaigh le COMHAD agus comhadlanna á gcóimheas.

source: --from-file=FILE1 Compare FILE1 to all operands. FILE1 can be a directory.
ga: --from-file=COMHAD Cuir COMHAD (nó comhadlann) i gcomparáid le gach oibreann.

source: --to-file=FILE2 Compare all operands to FILE2. FILE2 can be a directory.
ga: --to-file=COMHAD Cuir gach oibreann i gcomparáid le COMHAD (nó comhadlann).

source: --horizon-lines=NUM Keep NUM lines of the common prefix and suffix.
ga: --horizon-lines=UIMH Coinnigh UIMH líne den réimír/iarmhír choiteann.

source: -d --minimal Try hard to find a smaller set of changes.
ga: -d --minimal Obair go crua le haghaidh níos lú athruithe.

source: --speed-large-files Assume large files and many scattered small changes.
ga: --speed-large-files Comhaid móra agus go leor mionathruithe forleata.

source: FILES are `FILE1 FILE2' or `DIR1 DIR2' or `DIR FILE...' or `FILE... DIR'.
ga: COMHAID = `COMHAD1 COMHAD2' nó `COMHADLANN1 COMHADLANN2' nó `COMHADLANN COMHAD...' nó `COMHAD... COMHADLANN'.

source: If --from-file or --to-file is given, there are no restrictions on FILES.
ga: Má tá --from-file nó --to-file tugtha, níl a leithéid de shrian ar COMHAID.

source: If a FILE is `-', read standard input.
ga: Más '-' é an COMHAD, léigh ón ionchur caighdeánach.

source: Usage: %s [OPTION]... FILES
ga: Úsáid: %s [ROGHA]... COMHAID

source: conflicting %s option value `%s'
ga: luach contrártha don rogha %s: `%s'

source: conflicting output style options
ga: roghanna contrártha le haghaidh na stíle aschuir

source: Only in %s: %s
ga: I %s amháin: %s

source: cannot compare `-' to a directory
ga: ní féidir `-' a chur i gcomparáid le comhadlann

source: -D option not supported with directories
ga: Níl an rogha -D ar fáil do chomhadlanna

source: Common subdirectories: %s and %s
ga: Fochomhadlanna i gcoitianta: %s agus %s

source: File %s is a %s while file %s is a %s
ga: Tá comhad %s ina %s ach tá comhad %s ina %s

source: Files %s and %s are identical
ga: Is comhionann iad na comhaid %s agus %s

source: incompatible options
ga: roghanna neamh-chomhoiriúnacha

source: `-' specified for more than one input file
ga: bhí `-' tugtha le haghaidh níos mó ná inchomhad amháin

source: read failed
ga: theip ar léamh

source: -e --ed Output unmerged changes from OLDFILE to YOURFILE into MYFILE.
ga: -e --ed Scríobh i MOCHOMHAD na hathruithe neamhchumaiscthe ó SEANCHOMHAD go DOCHOMHAD.

source: -E --show-overlap Output unmerged changes, bracketing conflicts.
ga: -E --show-overlap Taispeáin na hathruithe neamhchumaiscthe agus cuir coinbhleachtaí idir lúibíní.

source: -A --show-all Output all changes, bracketing conflicts.
ga: -A --show-all Taispeáin gach athrú agus cuir coinbhleachtaí idir lúibíní.

source: -x --overlap-only Output overlapping changes.
ga: -x --overlap-only Taispeáin na hathruithe forluiteacha.

source: -X Output overlapping changes, bracketing them.
ga: -X Taispeáin na hathruithe forluiteacha, idir lúibíní.

source: -3 --easy-only Output unmerged nonoverlapping changes.
ga: -3 --easy-only Taispeáin athruithe neamhchumaiscthe forluiteacha.

source: -m --merge Output merged file instead of ed script (default -A).
ga: -m --merge Taispeáin comhad cumaiscthe in ionad script ed (réamhshocrú -A).

source: -L LABEL --label=LABEL Use LABEL instead of file name.
ga: -L LIPÉAD --label=LIPÉAD Úsáid LIPÉAD in ionad ainm comhaid.

source: -i Append `w' and `q' commands to ed scripts.
ga: -i Cuir na horduithe `w' agus `q' le scripteanna `ed'.

source: --diff-program=PROGRAM Use PROGRAM to compare files.
ga: --diff-program=CLÁR Bain úsáid as an CLÁR chun comhaid a chur i gcomparáid.

source: Usage: %s [OPTION]... MYFILE OLDFILE YOURFILE
ga: Úsáid: %s [ROGHA]... MOCHOMHAD SEANCHOMHAD DOCHOMHAD

source: Compare three files line by line.
ga: Cuir trí chomhad i gcomparáid, líne ar líne.

source: Exit status is 0 if successful, 1 if conflicts, 2 if trouble.
ga: Stádas scortha = 0 (rathúil), 1 (coinbhleachtaí), 2 (trioblóid).

source: internal error: screwup in format of diff blocks
ga: earráid inmheánach: formáid de na bloic diff trína chéile

source: %s: diff failed:
ga: %s: theip ar diff:

source: internal error: invalid diff type in process_diff
ga: earráid inmheánach: cineál neamhbhailí diff san fheidhm process_diff

source: invalid diff format; invalid change separator
ga: formáid diff neamhbhailí; teorantóir neamhbhailí idir athruithe

source: invalid diff format; incomplete last line
ga: formáid neamhbhailí diff; líne deiridh neamhiomlán

source: subsidiary program `%s' could not be invoked
ga: níorbh fhéidir an fochlár `%s' a rith

source: subsidiary program `%s' not found
ga: fochlár `%s' gan aimsiú

source: subsidiary program `%s' failed
ga: theip ar an fhochlár `%s'

source: subsidiary program `%s' failed (exit status %d)
ga: theip ar an fhochlár `%s' (stádas scortha %d)

source: invalid diff format; incorrect leading line chars
ga: formáid neamhbhailí diff; carachtair mhíchearta ag tosach na líne

source: internal error: invalid diff type passed to output
ga: earráid inmheánach: seachadadh cineál neamhbhailí diff go dtí an aschur

source: input file shrank
ga: crapadh an t-inchomhad

source: cannot compare file names `%s' and `%s'
ga: ní féidir na hainmneacha comhaid `%s' agus `%s' a chur i gcomparáid le chéile

source: -o FILE --output=FILE Operate interactively, sending output to FILE.
ga: -o COMHAD --output=COMHAD Mód idirghníomhach, ag scríobh an aschuir i gCOMHAD.

source: -i --ignore-case Consider upper- and lower-case to be the same.
ga: -i --ignore-case Ná bí cásíogair.

source: -W --ignore-all-space Ignore all white space.
ga: -W --ignore-all-space Déan neamhshuim ar spásanna bán go hiomlán.

source: -w NUM --width=NUM Output at most NUM (default 130) print columns.
ga: -w UIMH --width=UIMH UIMH colún priontála ar a mhéad (réamhshocrú=130).

source: -l --left-column Output only the left column of common lines.
ga: -l --left-column Ná taispeáin an colún ar dheis más ionann iad.

source: -s --suppress-common-lines Do not output common lines.
ga: -s --suppress-common-lines Ná taispeáin línte atá i bpáirt acu.

source: -H --speed-large-files Assume large files and many scattered small changes.
ga: -H --speed-large-files Comhaid móra agus go leor mionathruithe forleata.

source: Usage: %s [OPTION]... FILE1 FILE2
ga: Úsáid: %s [ROGHA]... COMHAD1 COMHAD2

source: Side-by-side merge of file differences.
ga: Cumaisc difríochtaí idir na comhaid, taobh le taobh.

source: cannot interactively merge standard input
ga: ní féidir an t-ionchur caighdeánach a chumasc go hidirghníomhach

source: both files to be compared are directories
ga: is comhadlanna iad na comhaid le cur i gcomparáid

source: ed: Edit then use both versions, each decorated with a header. eb: Edit then use both versions. el: Edit then use the left version. er: Edit then use the right version. e: Edit a new version. l: Use the left version. r: Use the right version. s: Silently include common lines. v: Verbosely include common lines. q: Quit.
ga: ed: Cuir na leaganacha araon in eagar, agus ceanntásc le gach. eb: Cuir na leaganacha araon in eagar, agus ansin bain úsáid astu. el: Cuir an leagan ar clé in eagar, agus ansin bain úsáid as. er: Cuir an leagan ar dheis in eagar, agus ansin bain úsáid as. e: Cuir leagan nua in eagar. l: Bain úsáid as an leagan ar clé. r: Bain úsáid as an leagan ar dheis. s: Cuir comhlínte san áireamh go balbh. v: Cuir comhlínte san áireamh go foclach. q: Scoir.
